#just a demo for print function in python
#普通输出
print("为什么没有输出啊!!")
#双引号输出
print("我试试不同‘引号’")
#单引号输出
print('单引号也可以输出啊!!')
#混合使用单引号和双引号
print("混合使用'单引号'和“双引号”也是可以的")
#转义符号应用在符号复杂情形下
print("复杂情况可以用转义符号\'来表示单引号, \"来表示双引号")
print('let\'s go')
#换行符的使用
print("第一行\n第二行\n第三行")
#制表符的使用
print("姓名\t年龄\t性别\n张三\t18\t男\n李四\t20\t女")
#多行(跨行)输出 三引号应用
#一般而言直接换行会报错
print("""这是第一行
这是第二行""")
print('''君不见，黄河之水天上来，奔流到海不复回。
君不见，高堂明镜悲白发，朝如青丝暮成雪。
人生得意须尽欢，莫使金樽空对月。
天生我材必有用，千金散尽还复来。
烹羊宰牛且为乐，会须一饮三百杯。
岑夫子，丹丘生，将进酒，杯莫停。 
与君歌一曲，请君为我倾耳听。 
钟鼓馔玉不足贵，但愿长醉不复醒。 
古来圣贤皆寂寞，惟有饮者留其名。 
陈王昔时宴平乐，斗酒十千恣欢谑。 
主人何为言少钱，径须沽取对君酌。''')